app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "a"], ["price", 1], ["description", "a"], ["created_at", "2015-09-21 13:45:03.901631"], ["updated_at", "2015-09-21 13:45:03.901631"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "name" = ?, "price" = ?, "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["name", "fesdfew"], ["price", 1111], ["description", "fadsfa"], ["updated_at", "2015-09-21 17:07:02.334941"], ["id", 3]]

  def update2
    if @item.update(item_params)
---
UPDATE "items" SET "description" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["description", "aaaaaaaaaa"], ["updated_at", "2015-09-28 10:16:35.987887"], ["id", 4]]